app/views/tickets/_form.html.erb

    <% end %>
    <%= form.select :status, Ticket::STATUS_OPTIONS, { prompt: "Select Status" }, class: "form-select" %>
---
SELECT "tickets".* FROM "tickets"

    <% end %>
    <%= form.collection_select :assignee_id, User.all, :id, :email, { prompt: "Select Assignee" }, class: "form-select" %>
---
SELECT "users".* FROM "users"

    <% end %>
    <%= form.collection_select :reporter_id, User.all, :id, :email, { prompt: "Select Reporter" }, class: "form-select" %>
---
SELECT "users".* FROM "users"