app/controllers/tickets_controller.rb

  def index
    @tickets = params[:query].present? ? Ticket.search(params[:query]) : Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("title", "description", "status", "priority", "assignee_id", "reporter_id", "due_date", "tags", "created_at", "updated_at") VALUES ('test3', '', 'In Progress', 'Medium', 1, NULL, '2026-01-31', '', '2026-01-29 23:56:45.616937', '2026-01-29 23:56:45.616937') RETURNING "id"

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "description" = 'test update', "tags" = 'tags, bugs', "updated_at" = '2026-01-30 16:38:38.166112' WHERE "tickets"."id" = 15

    def set_ticket
      @ticket = Ticket.find(params.expect(:id))
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 15 LIMIT 1